/* Copyright 2018, 2021 Intel
 *
 * Licensed under the Apache License, Version 2.0 (the "License");
 * you may not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 *    http://www.apache.org/licenses/LICENSE-2.0
 *
 *  Unless required by applicable law or agreed to in writing, software
 *  distributed under the License is distributed on an "AS IS" BASIS,
 *  WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 *  See the License for the specific language governing permissions and
 *  limitations under the License.
 */

#include <boost/container/flat_set.hpp>
#include <phosphor-logging/log.hpp>
#include <sdbusplus/asio/object_server.hpp>

#ifndef NODEMANAGERPROXY_HPP
#define NODEMANAGERPROXY_HPP

/**
 * @brief Dbus
 */
constexpr const char *nmdBus = "xyz.openbmc_project.NodeManagerProxy";
constexpr const char *nmdObj = "/xyz/openbmc_project/NodeManagerProxy";
constexpr const char *propObj = "/xyz/openbmc_project/sensors/";
constexpr const char *nmdSensorIntf = "xyz.openbmc_project.Sensor.Value";
constexpr const char *nmdPowerCapIntf = "xyz.openbmc_project.Control.Power.Cap";
constexpr const char *nmdPowerMetricIntf =
    "xyz.openbmc_project.Power.PowerMetric";
constexpr const char *meSoftwareObjPath = "/xyz/openbmc_project/software/me";
constexpr const char *softwareVerIntf = "xyz.openbmc_project.Software.Version";
constexpr const char *softwareActivationIntf =
    "xyz.openbmc_project.Software.Activation";

constexpr const char *ipmbBus = "xyz.openbmc_project.Ipmi.Channel.Ipmb";
constexpr const char *ipmbObj = "/xyz/openbmc_project/Ipmi/Channel/Ipmb";
constexpr const char *ipmbIntf = "org.openbmc.Ipmb";

constexpr const char *sensorConfPath =
    "xyz.openbmc_project.Configuration.NMSensor";
constexpr const char *sensorName = "Node_Manager_Sensor";
constexpr const char *associationInterface =
    "xyz.openbmc_project.Association.Definitions";

// this currently can be anything as it's only used to set the LED, might be
// good later to change it for redfish, but I'm not sure to what today
constexpr const char *meStatusPath = "/xyz/openbmc_project/status/me";

using Association = std::tuple<std::string, std::string, std::string>;

namespace power
{
const static constexpr char *busname = "xyz.openbmc_project.State.Host";
const static constexpr char *interface = "xyz.openbmc_project.State.Host";
const static constexpr char *path = "/xyz/openbmc_project/state/host0";
const static constexpr char *property = "CurrentHostState";
} // namespace power

/**
 * @brief NMd defines
 */
constexpr uint32_t readingsInterval = 10; // seconds
constexpr uint32_t framesInterval =
    100; // msec - number of frames per reading * framesInterval should be 2x
         // less than readingsInterval

/**
 * @brief Ipmb defines
 */
constexpr uint8_t ipmbMeChannelNum = 1;

/**
 * @brief Ipmi defines
 */
constexpr uint32_t ipmiIanaIntel = 0x157;

typedef struct
{
    uint8_t b0;
    uint8_t b1;
    uint8_t b2;
} __attribute__((packed)) ipmiIana;
static_assert(sizeof(ipmiIana) == 3);

constexpr void ipmiSetIntelIanaNumber(ipmiIana &iana)
{
    iana.b0 = static_cast<uint8_t>(ipmiIanaIntel & 0xFF);
    iana.b1 = static_cast<uint8_t>((ipmiIanaIntel >> 8) & 0xFF);
    iana.b2 = static_cast<uint8_t>((ipmiIanaIntel >> 16) & 0xFF);
}

/**
 * @brief Get Node Manager Statistics defines
 */
constexpr uint8_t ipmiGetNmStatisticsNetFn = 0x2E;
constexpr uint8_t ipmiGetNmStatisticsLun = 0;
constexpr uint8_t ipmiGetNmStatisticsCmd = 0xC8;

/**
 * @brief Set Node Manager Policy defines
 */
constexpr uint8_t ipmiSetNmPolicyNetFn = 0x2E;
constexpr uint8_t ipmiSetNmPolicyLun = 0;
constexpr uint8_t ipmiSetNmPolicyCmd = 0xC1;

/**
 * @brief Get Node Manager Policy defines
 */
constexpr uint8_t ipmiGetNmPolicyNetFn = 0x2E;
constexpr uint8_t ipmiGetNmPolicyLun = 0;
constexpr uint8_t ipmiGetNmPolicyCmd = 0xC2;

/**
 * @brief Get Node Manager Capabilites defines
 */
constexpr uint8_t ipmiGetNmCapabilitesNetFn = 0x2E;
constexpr uint8_t ipmiGetNmCapabilitesLun = 0;
constexpr uint8_t ipmiGetNmCapabilitesCmd = 0xC9;

// Mode
constexpr uint8_t globalPowerStats = 0x1;
constexpr uint8_t globalInletTempStats = 0x2;
constexpr uint8_t globalThrottlingStats = 0x3;
constexpr uint8_t globalVolAirflowStats = 0x4;
constexpr uint8_t globalOutletAirflowTempStats = 0x5;
constexpr uint8_t globalChassisPowerStats = 0x6;
constexpr uint8_t policyPowerStats = 0x11;
constexpr uint8_t globalHostUnhandleReqStats = 0x1B;
constexpr uint8_t globalHostResponseTimeStats = 0x1C;
constexpr uint8_t globalHostCommFailureStats = 0x1F;

// Domain Id
constexpr uint8_t entirePlatform = 0x0;
constexpr uint8_t cpuSubsystem = 0x1;
constexpr uint8_t memorySubsystem = 0x2;
constexpr uint8_t hwProtection = 0x3;
constexpr uint8_t highPowerIOsubsystem = 0x4;
constexpr uint8_t dcTotal = 0x5;

/**
 * @brief Get Device ID defines
 */
constexpr uint8_t ipmiGetDevIdNetFn = 0x6;
constexpr uint8_t ipmiGetDevIdLun = 0;
constexpr uint8_t ipmiGetDevIdCmd = 0x1;

/**
 * @brief Part of Get Device ID Command Response Payload
 */
typedef struct
{
    uint8_t fwMajorRev : 7,  // Binary encoded Major Version
        inUpgrade : 1;       // In Upgrade State
    uint8_t fwHotfixRev : 4, // BCD encoded Hotfix Version
        fwMinorRev : 4;      // BCD encoded Minor Version
} __attribute__((packed)) ipmiFwVerMajorMinor;

/**
 * @brief Part of Get Device ID Command Response Payload - Auxiliary
 * Firmware Revision Information
 */
typedef struct
{
    uint8_t nmVersion : 4, // Node Manager Version
        dcmiVersion : 4;   // DCMI Version
    uint8_t b : 4,         // BCD encoded Build Number - tens
        a : 4,             // BCD encoded Build Number - hundreds
        patch : 4,         // BCD encoded Patch Number
        c : 4;             // BCD encoded Build Number - digits
    uint8_t imageFlags;
} __attribute__((packed)) ipmiFwVerAux;

/**
 * @brief Get Device ID Command Full Response Payload
 */
typedef struct
{
    uint8_t deviceId;                 // Device ID
    uint8_t deviceRev : 4,            // Device Revision
        reserved0 : 3,                // Reserved bits
        sdrPresent : 1;               // SDR State
    ipmiFwVerMajorMinor fwMajorMinor; // Major and Minor Version
    uint8_t ipmiVersion;   // BCD encoded IPMI Version, reversed digit order
    uint8_t featureMask;   // Bitmask of supported features
    ipmiIana ianaId;       // Manufacturers ID
    uint8_t prodIdMinor;   // Product ID Minor Version
    uint8_t prodIdMajor;   // Product ID Major Version
    ipmiFwVerAux fwVerAux; // NmVersion, Build Number etc.
} __attribute__((packed)) ipmiGetDeviceIdResp;

/**
 * @brief Get Node Manager Statistics request format
 */
typedef struct
{
    ipmiIana iana;
    uint8_t mode : 5, reserved3B : 3;

    uint8_t domainId : 4, statsSide : 1, reserved : 2, perComponent : 1;
    union
    {
        uint8_t policyId;
        uint8_t componentId;
    };
} __attribute__((packed)) nmIpmiGetNmStatisticsReq;
static_assert(sizeof(nmIpmiGetNmStatisticsReq) == 6);

/**
 * @brief Get Node Manager Statistics response format
 */
typedef struct
{
    ipmiIana iana;
    union
    {
        struct
        {
            uint16_t cur;
            uint16_t min;
            uint16_t max;
            uint16_t avg;
        } stats;
        uint64_t energyAccumulator;
    } data;
    uint32_t timeStamp;
    uint32_t statsReportPeriod;
    uint8_t domainId : 4, policyGlobalState : 1, policyOperationalState : 1,
        measurmentsState : 1, policyActivationState : 1;
} __attribute__((packed)) nmIpmiGetNmStatisticsResp;
static_assert(sizeof(nmIpmiGetNmStatisticsResp) == 20);

/**
 * @brief Set Node Manager Policy request format
 */
typedef struct
{
    ipmiIana iana;
    uint8_t domainId : 4, policyEnabled : 1, reservedByte4 : 3;
    uint8_t policyId;
    uint8_t triggerType : 4, configurationAction : 1, cpuPowerCorrection : 2,
        storageOption : 1;
    uint8_t sendAlert : 1, shutdownSystem : 1, reservedByte7 : 6;
    int16_t limit;
    uint32_t correctionTime;
    uint16_t triggerLimit;
    uint16_t statsPeriod;
} __attribute__((packed)) nmIpmiSetNmPolicyReq;
static_assert(sizeof(nmIpmiSetNmPolicyReq) == 17);

/**
 * @brief Set Node Manager Policy response format
 */
typedef struct
{
    ipmiIana iana;
} __attribute__((packed)) nmIpmiSetNmPolicyResp;
static_assert(sizeof(nmIpmiSetNmPolicyResp) == 3);

/**
 * @brief Get Node Manager Policy request format
 */
typedef struct
{
    ipmiIana iana;
    uint8_t domainId : 4, reserved0 : 4;
    uint8_t policyId;
} __attribute__((packed)) nmIpmiGetNmPolicyReq;
static_assert(sizeof(nmIpmiGetNmPolicyReq) == 5);

/**
 * @brief Get Node Manager Policy response format
 */
typedef struct
{
    ipmiIana iana;
    uint8_t domainId : 4, policyEnabled : 1, domainEnabled : 1,
        globalEnabled : 1, external : 1;
    uint8_t triggerType : 4, policyType : 1, cpuPowerCorrection : 2,
        storageOption : 1;
    uint8_t sendAlert : 1, shutdownSystem : 1, reserved0 : 6;
    int16_t limit;
    uint32_t correctionTime;
    uint16_t triggerLimit;
    uint16_t statsPeriod;
} __attribute__((packed)) nmIpmiGetNmPolicyResp;
static_assert(sizeof(nmIpmiGetNmPolicyResp) == 16);

/**
 * @brief Get Node Manager Capabilites request format
 */
typedef struct
{
    ipmiIana iana;
    uint8_t domainId : 4, reserved0 : 4;
    uint8_t policyTriggerType : 4, policyType : 3, reserved1 : 1;
} __attribute__((packed)) nmIpmiGetNmCapabilitesReq;
static_assert(sizeof(nmIpmiGetNmCapabilitesReq) == 5);

/**
 * @brief Get Node Manager Capabilites response format
 */
typedef struct
{
    ipmiIana iana;
    uint8_t maxConcurentSettings;
    uint16_t maxLimit;
    uint16_t minLimit;
    uint32_t minCorrectionTime;
    uint32_t maxCorrectionTime;
    uint16_t minStatsReportingPeriod;
    uint16_t maxStatsReportingPeriod;
    uint8_t domainId : 4, reserved : 4;
} __attribute__((packed)) nmIpmiGetNmCapabilitesResp;
static_assert(sizeof(nmIpmiGetNmCapabilitesResp) == 21);

/**
 * @brief Ipmb utils
 */
using IpmbDbusRspType =
    std::tuple<int, uint8_t, uint8_t, uint8_t, uint8_t, std::vector<uint8_t>>;

int ipmbSendRequest(sdbusplus::asio::connection &conn,
                    IpmbDbusRspType &ipmbResponse,
                    const std::vector<uint8_t> &dataToSend, uint8_t netFn,
                    uint8_t lun, uint8_t cmd)
{
    try
    {
        auto mesg =
            conn.new_method_call(ipmbBus, ipmbObj, ipmbIntf, "sendRequest");
        mesg.append(ipmbMeChannelNum, netFn, lun, cmd, dataToSend);
        auto ret = conn.call(mesg);
        ret.read(ipmbResponse);
        return 0;
    }
    catch (sdbusplus::exception::SdBusError &e)
    {
        phosphor::logging::log<phosphor::logging::level::ERR>(
            "ipmbSendRequest:, dbus call exception");
        return -1;
    }
}

/**
 * @brief ME FW version class declaration
 */
class GetMeVer
{
  public:
